STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE_Zigbee/ZigbeeDirect_OnOff/STM32_WPAN/App/app_ble.c
  switch(pNotification->Opcode)
  {
    case ZDD_BLE_WRAP_TUNNELING_TUNNZDTSNPDU_UPDATEVALUE_EVT:
      tunneling_data.Length = pNotification->Data.Length;
      tunneling_data.p_Payload = pNotification->Data.pPayload;
      ret = TUNNELING_UpdateValue(TUNNELING_TUNNZDTSNPDU, &tunneling_data);
      break;
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519AES_UPDATEVALUE_EVT:
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519SHA_UPDATEVALUE_EVT:
    case ZDD_BLE_WRAP_ZDDSECURITY_SECURITY_P256SHA_UPDATEVALUE_EVT:
      zddsecurity_data.Length = pNotification->Data.Length;
      zddsecurity_data.p_Payload = pNotification->Data.pPayload;
      if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519AES_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_SECURITY25519AES, &zddsecurity_data);
      }
      else if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY25519SHA_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_SECURITY25519SHA, &zddsecurity_data);
      }
      else if (pNotification->Opcode == ZDD_BLE_WRAP_ZDDSECURITY_SECURITY_P256SHA_UPDATEVALUE_EVT)
      {
        ret = ZDDSECURITY_UpdateValue(ZDDSECURITY_P256SHA, &zddsecurity_data);
      }
      break;
    case ZDD_BLE_WRAP_ZIGBEEDIRECTCOMM_COMMSTATUS_UPDATEVALUE_EVT:
      zigbeedirectcomm_data.Length = pNotification->Data.Length;
      zigbeedirectcomm_data.p_Payload = pNotification->Data.pPayload;
      ret = ZIGBEEDIRECTCOMM_UpdateValue(ZIGBEEDIRECTCOMM_COMMSTATUS, &zigbeedirectcomm_data);
      break;
    case ZDD_BLE_WRAP_BLE_START_ADVERTISING_EVT:
      APP_BLE_StartAdvertising(pNotification->AdvData.PanId,
                               pNotification->AdvData.NwkAddr,
                               pNotification->AdvData.PJoin);
      break;
    case ZDD_BLE_WRAP_BLE_STOP_ADVERTISING_EVT:
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      break;
    case ZDD_BLE_WRAP_OS_SHCEDULE_ZDD_TASK_EVT:
      UTIL_SEQ_SetTask(1u << CFG_TASK_ZIGBEE_ZDD, CFG_SEQ_PRIO_1);
      break;
    default:
      ret = false;
      break;
  }

  return ret;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static uint8_t HOST_BLE_Init(void)
{
  tBleStatus return_status;

  pInitParams.numAttrRecord           = CFG_BLE_NUM_GATT_ATTRIBUTES;
  pInitParams.numAttrServ             = CFG_BLE_NUM_GATT_SERVICES;
  pInitParams.attrValueArrSize        = CFG_BLE_ATT_VALUE_ARRAY_SIZE;
  pInitParams.prWriteListSize         = CFG_BLE_ATTR_PREPARE_WRITE_VALUE_SIZE;
  pInitParams.attMtu                  = CFG_BLE_ATT_MTU_MAX;
  pInitParams.max_coc_nbr             = CFG_BLE_COC_NBR_MAX;
  pInitParams.max_coc_mps             = CFG_BLE_COC_MPS_MAX;
  pInitParams.max_coc_initiator_nbr   = CFG_BLE_COC_INITIATOR_NBR_MAX;
  pInitParams.max_add_eatt_bearers    = CFG_BLE_EATT_BEARER_PER_LINK * CFG_BLE_NUM_LINK;
  pInitParams.numOfLinks              = CFG_BLE_NUM_LINK;
  pInitParams.mblockCount             = CFG_BLE_MBLOCK_COUNT;
  pInitParams.bleStartRamAddress      = (uint8_t*)host_buffer;
  pInitParams.total_buffer_size       = BLE_DYN_ALLOC_SIZE;
  pInitParams.bleStartRamAddress_GATT = (uint8_t*)gatt_buffer;
  pInitParams.total_buffer_size_GATT  = BLE_GATT_BUF_SIZE;
  pInitParams.extra_data_buffer_size  = CFG_BLE_EXTRA_DATA_BUF_SIZE;
  pInitParams.extra_data_buffer       = (uint8_t*)extra_data_buffer;
  pInitParams.gatt_long_write_buffer  = (uint8_t*)long_write_buffer;
  pInitParams.host_event_fifo_buffer  = host_event_buffer;
  pInitParams.host_event_fifo_buffer_size = DIVC(BLE_HOST_EVENT_BUF_SIZE, 2);
  pInitParams.nvm_cache_buffer        = host_nvm_buffer;
  pInitParams.nvm_cache_max_size      = CFG_BLE_NVM_SIZE_MAX;
  pInitParams.nvm_cache_size          = CFG_BLE_NVM_SIZE_MAX - 1;
  pInitParams.options                 = CFG_BLE_OPTIONS;
  pInitParams.debug                   = 0U;
/* USER CODE BEGIN HOST_BLE_Init_Params */

/* USER CODE END HOST_BLE_Init_Params */
  return_status = BleStack_Init(&pInitParams);
/* USER CODE BEGIN HOST_BLE_Init */

/* USER CODE END HOST_BLE_Init */
  return ((uint8_t)return_status);
}

static void Ble_Hci_Gap_Gatt_Init(void)
{
  uint8_t role;
  uint16_t gap_service_handle = 0U, gap_dev_name_char_handle = 0U, gap_appearance_char_handle = 0U;
  const uint8_t *p_bd_addr;
  uint16_t a_appearance[1] = {CFG_GAP_APPEARANCE};
  const uint8_t *p_ir_value;
  const uint8_t *p_er_value;
  tBleStatus ret;

  /* USER CODE BEGIN Ble_Hci_Gap_Gatt_Init */
/* Add number of record for Device Info Characteristic */
  static const uint8_t p_additional_svc_record[1] = {0x03};

  ret = aci_hal_write_config_data(CONFIG_DATA_GAP_ADD_REC_NBR_OFFSET,
                                  CONFIG_DATA_GAP_ADD_REC_NBR_LEN,
                                  (uint8_t*) p_additional_svc_record);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_GAP_ADD_REC_NBR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_GAP_ADD_REC_NBR_OFFSET\n");
  }
  /* USER CODE END Ble_Hci_Gap_Gatt_Init */

  LOG_INFO_APP("==>> Start Ble_Hci_Gap_Gatt_Init function\n");

  /* Write the BD Address */
  p_bd_addr = BleGenerateBdAddress();

  /* USER CODE BEGIN BD_Address_Mngt */

  /* USER CODE END BD_Address_Mngt */

  ret = aci_hal_write_config_data(CONFIG_DATA_PUBADDR_OFFSET,
                                  CONFIG_DATA_PUBADDR_LEN,
                                  (uint8_t*) p_bd_addr);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_PUBADDR_OFFSET\n");
    LOG_INFO_APP("  Public Bluetooth Address: %02x:%02x:%02x:%02x:%02x:%02x\n",p_bd_addr[5],p_bd_addr[4],p_bd_addr[3],p_bd_addr[2],p_bd_addr[1],p_bd_addr[0]);
  }

  /* Generate Identity root key Value */
  p_ir_value = BleGenerateIRValue();

  /* Write Identity root key used to derive IRK and DHK(Legacy) */
  ret = aci_hal_write_config_data(CONFIG_DATA_IR_OFFSET, CONFIG_DATA_IR_LEN, p_ir_value);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: aci_hal_write_config_data command - CONFIG_DATA_IR_OFFSET\n");
  }

  /* Generate Encryption root key Value */
  p_er_value = BleGenerateERValue();

